// /*++
// Copyright (c) 2009 Intel Corporation. All rights reserved.
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
// --*/
/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"



#string STR_ABOVE4GB                    #language en-US   "Above 4G Decoding"
                                        #language zh-Hans "4GB\wide以上空间解码\narrow"
#string STR_ABOVE4GB_HELP               #language en-US   "Above 4G Decoding"
                                        #language zh-Hans "4GB\wide以上空间解码\narrow"
#string STR_HYPER_THREAD                #language en-US   "Hyper Threading Technology"
                                        #language zh-Hans "\wide超线程技术\narrow"
#string STR_HYPER_THREAD_HELP           #language en-US   "Enable or Disable Hyper Thread"
                                        #language zh-Hans "\wide打开或关闭超线程\narrow"
#string STR_NVME_FORM                   #language en-US   "NVMe configuration"
                                        #language zh-Hans "NVMe\wide配置\narrow"
#string STR_NVME_DEVICE_SUPPORT         #language en-US   "NVMe SSD Support"
                                        #language zh-Hans "NVMe SSD Support"
#string STR_NVME_DEVICE_SUPPORT_HELP    #language en-US   "NVMe SSD device cannot be used under BIOS after disable this."
                                        #language zh-Hans "\wide关闭选项后\narrowNVMe SSD\wide设备在固件阶段会被禁用\narrow"

#string STR_X8                          #language en-US   "X8"
                                        #language zh-Hans "X8"
#string STR_X4                          #language en-US   "X4"
                                        #language zh-Hans "X4"
#string STR_X2                          #language en-US   "X2"
                                        #language zh-Hans "X2"
#string STR_X1                          #language en-US   "X1"
                                        #language zh-Hans "X1"
#string STR_PCIESLOT_WIDTH              #language en-US   "PCIE Width"
                                        #language zh-Hans "PCIE Width"
#string STR_PCIESLOT_WIDTH_HELP         #language en-US   "PCIE Width"
                                        #language zh-Hans "PCIE Width"
#string STR_GEN3                        #language en-US   "Gen3"
                                        #language zh-Hans "Gen3"
#string STR_GEN2                        #language en-US   "Gen2"
                                        #language zh-Hans "Gen2"
#string STR_GEN1                        #language en-US   "Gen1"
                                        #language zh-Hans "Gen1"
#string STR_GENMAX                      #language en-US   "Maximum supported"
                                        #language zh-Hans "Maximum supported"
#string STR_PCIESLOT_ASPM               #language en-US   "PCIE ASPM"
                                        #language zh-Hans "PCIE\wide活动状态电源管理\narrow"
#string STR_PCIESLOT_ASPM_HELP          #language en-US   "Set PCIE ASPM"
                                        #language zh-Hans "\wide设定\narrowPCIE\wide活动状态电源管理\narrow"
#string STR_L0S                         #language en-US   "L0s"
                                        #language zh-Hans "L0s"
#string STR_L1                          #language en-US   "L1"
                                        #language zh-Hans "L1"
#string STR_L0SL1                       #language en-US   "L0s&L1"
                                        #language zh-Hans "L0s&L1"
#string STR_PCIESLOT_MAXPAYLOAD         #language en-US   "PCIE Max Payload Size"
                                        #language zh-Hans "PCIE\wide最大负载\narrow"
#string STR_PCIESLOT_MAXPAYLOAD_HELP    #language en-US   "Set Maximum Payload of PCI Express Device."
                                        #language zh-Hans "\wide设置\narrowPCIE\wide最大负载\narrow"
#string STR_MP128                       #language en-US   "128B"
                                        #language zh-Hans "128B"
#string STR_MP256                       #language en-US   "256B"
                                        #language zh-Hans "256B"
#string STR_MP512                       #language en-US   "512B"
                                        #language zh-Hans "512B"

#string STR_SATA_FORM                   #language en-US   "SATA Configuration"
                                        #language zh-Hans "SATA\wide配置\narrow"
#string STR_SATA_PORT                   #language en-US   "SATA Port Control"
                                        #language zh-Hans "SATA Port\wide控制\narrow"
#string STR_SATA_CONTROL1               #language en-US   "SATA Controller 1 Configuration"
                                        #language zh-Hans "SATA\wide控制器 1 配置\narrow"
#string STR_SATA_CONTROL2               #language en-US   "SATA Controller 2 Configuration"
                                        #language zh-Hans "SATA\wide控制器 2 配置\narrow"
#string STR_SATA_CONTROL3               #language en-US   "SATA Controller 3 Configuration"
                                        #language zh-Hans "SATA\wide控制器 3 配置\narrow"
#string STR_SATA_CONTROL4               #language en-US   "SATA Controller 4 Configuration"
                                        #language zh-Hans "SATA\wide控制器 4 配置\narrow"
#string STR_SATA_PORT0                  #language en-US   "SATA Port1"
                                        #language zh-Hans "SATA Port1"
#string STR_SATA_PORT1                  #language en-US   "SATA Port2"
                                        #language zh-Hans "SATA Port2"
#string STR_SATA_PORT2                  #language en-US   "SATA Port3"
                                        #language zh-Hans "SATA Port3"
#string STR_SATA_PORT3                  #language en-US   "SATA Port4"
                                        #language zh-Hans "SATA Port4"
#string STR_SATA_PORT4                  #language en-US   "SATA Port5"
                                        #language zh-Hans "SATA Port5"
#string STR_SATA_PORT5                  #language en-US   "SATA Port6"
                                        #language zh-Hans "SATA Port6"
#string STR_SATA_PORT6                  #language en-US   "SATA Port7"
                                        #language zh-Hans "SATA Port7"
#string STR_SATA_PORT7                  #language en-US   "SATA Port8"
                                        #language zh-Hans "SATA Port8"
#string STR_SATA_PORT_HELP              #language en-US   "SATA Port Configuration"
                                        #language zh-Hans "SATA Port\wide控制\narrow"
#string STR_SATA_PORT0_SPEED            #language en-US   "SATA Port1 Speed"
                                        #language zh-Hans "SATA Port1 Speed"
#string STR_SATA_PORT1_SPEED            #language en-US   "SATA Port2 Speed"
                                        #language zh-Hans "SATA Port2 Speed"
#string STR_SATA_PORT2_SPEED            #language en-US   "SATA Port3 Speed"
                                        #language zh-Hans "SATA Port3 Speed"
#string STR_SATA_PORT3_SPEED            #language en-US   "SATA Port4 Speed"
                                        #language zh-Hans "SATA Port4 Speed"
#string STR_SATA_PORT4_SPEED            #language en-US   "SATA Port5 Speed"
                                        #language zh-Hans "SATA Port5 Speed"
#string STR_SATA_PORT5_SPEED            #language en-US   "SATA Port6 Speed"
                                        #language zh-Hans "SATA Port6 Speed"
#string STR_SATA_PORT6_SPEED            #language en-US   "SATA Port7 Speed"
                                        #language zh-Hans "SATA Port7 Speed"
#string STR_SATA_PORT7_SPEED            #language en-US   "SATA Port8 Speed"
                                        #language zh-Hans "SATA Port8 Speed"
#string STR_SATA_PORT_SPEED_HELP        #language en-US   "SATA Port Speed Configuration"
                                        #language zh-Hans "SATA Port\wide速度控制\narrow"
#string STR_USB_FORM                    #language en-US   "USB Configuration"
                                        #language zh-Hans "USB\wide配置\narrow"                                        
//#string STR_USB_0_FORM                  #language en-US   "Socket 0 Die 0 USB port Configuration"
//                                        #language zh-Hans "Socket 0 Die 0 USB port\wide配置\narrow"
#string STR_USB_0_FORM                  #language en-US   "Rear USB port Configuration"
                                        #language zh-Hans "\wide后置\narrowUSB\wide端口配置\narrow"
//#string STR_USB_1_FORM                  #language en-US   "Socket 0 Die 1 USB port Configuration"
//                                        #language zh-Hans "Socket 0 Die 1 USB port\wide配置\narrow"
#string STR_USB_1_FORM                  #language en-US   "Front USB port Configuration"
                                        #language zh-Hans "\wide前置\narrowUSB\wide端口配置\narrow"

#string STR_USB_2_FORM                  #language en-US   "Socket 1 Die 0 USB port Configuration"
                                        #language zh-Hans "Socket 1 Die 0 USB port\wide配置\narrow"
#string STR_USB_3_FORM                  #language en-US   "Socket 1 Die 1 USB port Configuration"
                                        #language zh-Hans "Socket 1 Die 1 USB port\wide配置\narrow"
#string STR_USB_PORT                    #language en-US   "USB Port Control"
                                        #language zh-Hans "USB Port\wide控制\narrow"
#string STR_USB_PORT0                   #language en-US   "USB2.0 Port 0"
                                        #language zh-Hans "USB2.0 Port 0"
#string STR_USB_PORT1                   #language en-US   "USB2.0 Port 1"
                                        #language zh-Hans "USB2.0 Port 1"
#string STR_USB_PORT2                   #language en-US   "USB3.0 Port 0"
                                        #language zh-Hans "USB3.0 Port 0"
#string STR_USB_PORT3                   #language en-US   "USB3.0 Port 1"
                                        #language zh-Hans "USB3.0 Port 1"
#string STR_USB_PORT_HELP               #language en-US   "USB Port Configuration"
                                        #language zh-Hans "USB\wide端口配置\narrow"

#string STR_ERRMGMT_FORM                        #language en-US  "Error Management"
                                                #language zh-Hans "\wide错误管理\narrow"
#string STR_ERRMGMT_FORM_HELP                   #language en-US  "Error Management settings."
                                                #language zh-Hans "\wide错误管理设置\narrow"

#string STR_PLATFORM_FIRST_ERROR_HANDLING       #language en-US  "Platform First Error Handling"
                                                #language zh-Hans "\wide错误管理\narrow"
#string STR_PLATFORM_FIRST_ERROR_HANDLING_HELP  #language en-US  "Enable/Disable PFEH"
                                                #language zh-Hans "\wide打开或关闭\narrowPFEH"

#string STR_MCA_ERR_THRESH_COUNT                #language en-US  "MCA Error Threshold Count"
                                                #language zh-Hans "MCA\wide错误数量控制\narrow"
#string STR_MCA_ERR_THRESH_COUNT_HELP           #language en-US  "MCA Error Threshold Count, 0-Disable Error"
                                                #language zh-Hans "MCA\wide错误数量控制，\narrow0\wide标识关闭错误！\narrow"
#string STR_0                                   #language en-US  "0"
                                                #language zh-Hans "0"
#string STR_1                                   #language en-US  "1"
                                                #language zh-Hans "1"
#string STR_5                                   #language en-US  "5"
                                                #language zh-Hans "5"
#string STR_10                                  #language en-US  "10"
                                                #language zh-Hans "10"
#string STR_100                                 #language en-US  "100"
                                                #language zh-Hans "100"
#string STR_1000                                #language en-US  "1000"
                                                #language zh-Hans "1000"
#string STR_2000                                #language en-US  "2000"
                                                #language zh-Hans "2000"
                                                
#string STR_SR_IOV                              #language en-US   "SR-IOV Support"
                                                #language zh-Hans "SR-IOV\wide支持\narrow"
#string STR_SR_IOV_HELP                         #language en-US   "Indicates if the Single Root I/O virtualization is supported."
                                                #language zh-Hans "\wide表明是否支持单根\narrowI/O\wide虚拟化。\narrow"
#string STR_SERIAL_DEBUG_MSG_PROMPT             #language en-US   "Debug Mode"
                                                #language zh-Hans "\wide调试模式\narrow"
#string STR_SERIAL_DEBUG_MSG_HELP               #language en-US   "Debug message setting"
                                                #language zh-Hans "\wide调试信息设置\narrow"                                                
#string STR_P_STATE                             #language en-US   "  CPU P-State Control"
                                                #language zh-Hans "  CPU P-State\wide控制\narrow"
#string STR_MAX_CPU_FREQUENCY                   #language en-US   "CPU Max Frequency"
                                                #language zh-Hans "CPU\wide最大频率\narrow"
#string STR_MAX_CPU_FREQUENCY_HELP              #language en-US   "CPU Max Frequency"
                                                #language zh-Hans "CPU\wide最大频率\narrow"
#string STR_FULL_SPEED                          #language en-US   "100%"
                                                #language zh-Hans "100%"
#string STR_EIGHTY_PECENTAGE                    #language en-US   "80%"
                                                #language zh-Hans "80%"
#string STR_SIXTY_PECENTAGE                     #language en-US   "60%"
                                                #language zh-Hans "60%"
#string STR_FORTY_PECENTAGE                     #language en-US   "40%"
                                                #language zh-Hans "40%"
#string STR_TWENTY_PECENTAGE                    #language en-US   "20%"
                                                #language zh-Hans "20%"
#string STR_P_STATE_HELP                        #language en-US   "Control Processor performance. Here we could control which PSTATE CPU could support."
                                                #language zh-Hans "\wide控制处理器的性能。可以控制处理器支持的\narrowPSTATE\wide。\narrow"
#string STR_NORMAL                              #language en-US   "Enabled"
                                                #language zh-Hans "\wide打开\narrow"
#string STR_PERFORMANCE                         #language en-US   "Disabled"
                                                #language zh-Hans "\wide关闭\narrow"
#string STR_P0                                  #language en-US   "P0"
                                                #language zh-Hans "P0"
#string STR_P0P1                                #language en-US   "P0+P1"
                                                #language zh-Hans "P0+P1"
#string STR_P0P1P2                              #language en-US   "P0+P1+P2"
                                                #language zh-Hans "P0+P1+P2"

#string STR_C_STATE                             #language en-US   "  CPU C-State Control"
                                                #language zh-Hans "  CPU C-State\wide控制\narrow"
#string STR_C_STATE_HELP                        #language en-US   "Support CPU C6 if enabled, or C6 is disabled."
                                                #language zh-Hans "\wide打开时支持\narrowC6\wide，关闭时不支持\narrowC6\wide。\narrow"


                                                
#string STR_SERVER_MGMT                     #language en-US   "Server Configuration"
                                            #language zh-Hans "\wide服务管理\narrow"
#string STR_SERVER_MGMT_HELP                #language en-US   "Server Configuration Settings"
                                            #language zh-Hans "\wide服务管理设置\narrow"

#string STR_AFTER_POWER_LOSS                   #language en-US  "After Power Loss"
                                               #language zh-Hans "\wide电源丢失策略\narrow"
#string STR_AFTER_POWER_LOSS_HELP              #language en-US  "Determine the state of the system after power failure and reenergizing."
                                               #language zh-Hans "\wide确定设备断电重新上电后系统的状态。\narrow"
#string STR_CORE_PERFORMANCE_BOOST             #language en-US    "Core Performance Boost"
                                               #language zh-Hans  "\wide核心性能提升\narrow"
#string STR_CORE_PERFORMANCE_BOOST_HELP        #language en-US    "Disable CPB"
                                               #language zh-Hans  "\wide禁用\narrow CPB"
#string STR_OFF                                #language en-US  "Off"
                                               #language zh-Hans "\wide关\narrow"
#string STR_ON                                 #language en-US   "On"
                                               #language zh-Hans "\wide开\narrow"
#string STR_PREVIOUS_STATE                     #language en-US  "Previous State"
                                               #language zh-Hans "\wide之前的状态\narrow"

#string STR_BIOS_POWERON                       #language en-US    "Wake from RTC"
                                               #language zh-Hans  "RTC\wide唤醒\narrow"
#string STR_BIOS_POWERON_HELP                  #language en-US    "Enable the days of the week to turn the system on.This feature wakes the system up from a powered off state."
                                               #language zh-Hans  "\wide选择系统启动的星期和时间。此功能可将系统从关闭状态中唤醒。\narrow"

#string STR_SUNDAY                             #language en-US  "Sunday"
                                                  #language zh-Hans "\wide星期日\narrow"
#string STR_MONDAY                             #language en-US   "Monday"
                                                  #language zh-Hans "\wide星期一\narrow"
#string STR_TUESDAY                            #language en-US   "Tuesday"
                                                  #language zh-Hans "\wide星期二\narrow"
#string STR_WEDNESDAY                          #language en-US   "Wednesday"
                                                  #language zh-Hans "\wide星期三\narrow"
#string STR_THURSDAY                           #language en-US   "Thursday"
                                                  #language zh-Hans "\wide星期四\narrow"
#string STR_FIRDAY                             #language en-US   "Friday"
                                                  #language zh-Hans "\wide星期五\narrow"
#string STR_SATURDAY                           #language en-US   "Saturday"
                                                  #language zh-Hans "\wide星期六\narrow"
#string STR_BIOS_POWERON_EVERYDAY_HELP         #language en-US   "Enable the days of the week to turn the system on. This feature wakes the system up from a powered off state."
                                                  #language zh-Hans "\wide选择系统启动的星期和时间。此功能可将系统从关闭状态中唤醒。\narrow"
#string STR_RTC_TIME                           #language en-US   "Time(hh:mm:ss)"
                                                  #language zh-Hans "\wide时间（时：分：秒）\narrow"
#string STR_RTC_TIME_HELP                      #language en-US   "Enter the time using the specified format. Use 24-hour format."
                                                  #language zh-Hans "\wide输入指定格式的时间。使用\narrow24\wide小时制。\narrow"
                                            
#string STR_HYGON_CBS                          #language en-US   "Hygon CBS"  
                                               #language zh-Hans "\wide海光设置\narrow"
#string STR_HYGON_CBS_HELP                     #language en-US   "Hygon CBS"  
                                               #language zh-Hans "\wide海光设置\narrow"    

#string STR_ADVANCE_MISC_CONFIG                #language en-US   "Misc Configuration"  
                                               #language zh-Hans "Misc\wide设置\narrow"  

#string STR_ABOVE4GB_LIMIT                      #language en-US   "MMIO High Limit"
                                               #language zh-Hans "MMIO\wide高地址上限\narrow"
#string STR_ABOVE4GB_LIMIT_HELP                 #language en-US   "MMIO High Base"
                                               #language zh-Hans "MMIO\wide高地址上限\narrow"                                                
#string STR_64T                                 #language en-US  "64TB"
                                               #language zh-Hans "64TB" 
#string STR_32T                                #language en-US   "32TB"
                                               #language zh-Hans "32TB" 
#string STR_16T                                 #language en-US  "16TB"
                                               #language zh-Hans "16TB" 

#string STR_PERF_MODE                          #language en-US   "ENERGY_PERF_BIAS_CFG mode"
                                               #language zh-Hans "\wide性能模式\narrow" 
#string STR_PERF_MODE_HELP                     #language en-US   "Under User defined mode, user could set CPU PSTATE and CSTATE. Under High mode, CPU PSTATE and CSTATE will be disabled."
                                               #language zh-Hans "\wide在用户自定义模式下，用户可以设定\narrowCPU\wide的\narrowCSTATE\wide和\narrowPSTATE\wide。在高性能模式下，\narrowCPU\wide的\narrowCSTATE\wide和\narrowPSTATE\wide将被关闭。\narrow" 
#string STR_PERF_MODE_OEM                      #language en-US   "User Defined"
                                               #language zh-Hans "\wide用户自定义\narrow" 
#string STR_PERF_MODE_HIGH                     #language en-US   "Performance"
                                               #language zh-Hans "\wide高性能\narrow" 

#string STR_CPU_SPEED_SET                      #language en-US   "  Set CPU Speed"  
                                               #language zh-Hans "  \wide设定\narrowCPU\wide频率\narrow"
#string STR_CPU_SPEED_SET_HELP                 #language en-US   "Set CPU Speed"  
                                               #language zh-Hans "\wide设定\narrowCPU\wide频率\narrow"
#string STR_SPEED1_VALUE                       #language en-US   "1"  
                                               #language zh-Hans "1"
#string STR_SPEED2_VALUE                       #language en-US   "2"  
                                               #language zh-Hans "2"
#string STR_SPEED3_VALUE                       #language en-US   "3"  
                                               #language zh-Hans "3"
#string STR_VIRTUALIZATION_CTRL_FORM           #language en-US "Virtualization"
                                               #language zh-Hans "\wide虚拟化配置\narrow"
#string STR_VIRTUALIZATION_CTRL_FORM_HELP      #language en-US "Select this option to view virtualization  configuration."
                                               #language zh-Hans "\wide选择此选项查看虚拟化配置信息。\narrow"		  

#string STR_SCREEN_PRINT                       #language en-US   "Silk screen start number"  
                                               #language zh-Hans "\wide丝印起始号\narrow"
#string STR_SCREEN_PRINT_HELP                  #language en-US   "Select this option to modify the start number of the Silk screen on the motherboard."  
                                               #language zh-Hans "\wide选择此项来修改主板上丝印的起始编号。\narrow"   
#string STR_SP0_VAL                            #language en-US   "0"  
                                               #language zh-Hans "0"
#string STR_SP1_VAL                            #language en-US   "1"  
                                               #language zh-Hans "1"
											   
#string STR_SLIMLINE_MODE                      #language en-US   "Slimline Mode"  
                                               #language zh-Hans "Slimline\wide模式\narrow"
#string STR_SLIMLINE_MODE_HELP                 #language en-US   "Slimline Mode"  
                                               #language zh-Hans "Slimline\wide模式\narrow"	

#string STR_SATA_MODE                      #language en-US   "SATA"  
                                               #language zh-Hans "SATA"	
#string STR_OCP_MODE                      #language en-US   "OCP"  
                                               #language zh-Hans "OCP"	
#string STR_NVME_MODE                      #language en-US   "NVME"  
                                               #language zh-Hans "NVME"	

#string STR_DIMM_ERROR                       #language en-US   "Memory error behavior"  
                                               #language zh-Hans "\wide内存错误行为\narrow"
#string STR_DIMM_ERROR_HELP                  #language en-US   "Select this option to modify whether the system will shut down or continue to boot when memory errors occur."  
                                               #language zh-Hans "\wide选择此项来修改内存出错时系统关机还是继续启动。\narrow"   	
#string STR_CONTINUE_START                       #language en-US   "Continue to start"  
                                               #language zh-Hans "\wide继续启动\narrow"			
 #string STR_BIOS_LOCK               		#language en-US   "SPI BIOS Lock"
                                        	#language zh-Hans "SPI BIOS\wide锁住\narrow"
#string STR_BIOS_LOCK_HELP              	#language en-US   "Enable or Disable flash BIOS."
                                        	#language zh-Hans "\wide打开或关闭刷写\narrowBIOS"                                              
#string STR_TPM_SELECT                         #language en-US    "TPM Select"
                                               #language zh-Hans  "TPM\wide选择\narrow"
#string STR_TPM_SELECT_HELP                    #language en-US    "TPM module selection: DTPM uses Onboard TPM chip, FTPM uses TPM module provided by Hygon CPU. If the current system does not support the selected module, BIOS will automatically turn off this option after saving and restarting."
                                               #language zh-Hans  "TPM\wide模块选择\narrow: DTPM\wide使用板载\narrowTPM\wide芯片\narrowFTPM\wide使用海光\narrowCPU\wide提供的\narrowTPM\wide模块\narrow,\wide如果当前系统不支持选择的模块\narrow,BIOS\wide会在保存重启后自动关闭此选项\narrow."
#string STR_DTPM                               #language en-US    "DTPM"
                                               #language zh-Hans  "DTPM"
#string STR_FTPM                               #language en-US    "FTPM"
                                               #language zh-Hans  "FTPM"   
#string STR_TPM_VERSION                        #language en-US    "TPM Version"
                                               #language zh-Hans  "TPM\wide版本\narrow"   
#string STR_DTPM_VERSION_VALUE                 #language en-US    "TPM 2.0"
                                               #language zh-Hans  "TPM 2.0" 
#string STR_FTPM_VERSION_VALUE                 #language en-US    "156"
                                               #language zh-Hans  "156"  	

#string STR_AES_SUPPORT                        #language en-US    "AES"
                                               #language zh-Hans  "AES" 											   
#string STR_AES_SUPPORT_HELP                   #language en-US    "AES Ebale or Disable."
                                               #language zh-Hans  "AES \wide打开或关闭\narrow" 

#string STR_HIDE_BRAND_LOGO                    #language en-US   "Hide Boot Logo"
                                               #language zh-Hans "\wide隐藏开机\narrowLogo"
#string STR_HIDE_BRAND_LOGO_HELP               #language en-US   "Hide brand logo when booting."
                                               #language zh-Hans "\wide隐藏开机\narrowLogo."